Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །དེ་བཞིན་གཤེགས་པ་དེ་དག་ལས་ཆོས་གནང་བའི་སྒོའི་ཆོས་བཤད་པ་ཆེན་པོ་ཐོས་པར་འགྱུར།
en: He will see hosts of bodhisattvas sitting opposite the tathāgatas, listening to their great Dharma discourses that introduce and elucidate the Dharma.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་གཟུགས་དང་རྒྱན་དང་གཞལ་མེད་ཁང་སྟོན་པར་འགྱུར།
en: He will see the form of Noble Avalokiteśvara with all his ornaments and his palace. “

source: མགུལ་དུ་བཏགས་ན་ཕུག་གི་གནས་ཐམས་ཅད་དུ་འཇུག་པར་འགྱུར།
en: If he ties the great jewel to his neck, he will be able to enter all the terrestrial passages and the dwellings they lead to.

source: ཐམས་ཅད་དུ་རྒྱལ་བའི་རྗེ་དཔོན་དང་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར། ཕུག་སྟོང་ཕྲག་དྲུག །ཅུ་རྩ་བཞིའི་སྒོ་འབྱེ་བར་འགྱུར།
en: In all these places, he will become the emperor Jayaprabhurāja, and the gates to sixty-four thousand palaces entered via terrestrial passages will be open for him. “

source: དཔུང་པ་གཡས་པ་ལ་བཏགས་ན་མི་སྣང་བར་འགྱུར་ཞིང་ལུས་མི་སྣང་བ་གང་གཱའི་ཀླུང་བྱེ་བ་སྟོང་ཕྲག་བརྒྱ་སྙེད་ཀྱི་ལུས་མི་སྣང་བ་རྣམས་ཀྱི་མཆོག་རྗེ་དཔོན་དང་རྒྱལ་པོར་འགྱུར་རོ།
en: If he ties the jewel to his right arm he will become invisible. Able to disappear at will, he will be the foremost among and the powerful king of hundreds of thousands of millions of those who can likewise disappear at will, equal in number to the grains of sand in the Gaṅgā river.

source: །དཔུང་བ་གཡོན་པ་ལ་བཏགས་ན་གནོད་སྦྱིན་དང་སྲིན་པོ་དང་འབྱུང་པོ་ལ་སོགས་པ་ཐམས་ཅད་མི་སྣང་བར་བྱས་པར་འགྱུར།
en: If he ties the jewel to his left arm he will become invisible to all yakṣas, rākṣasas, bhūtas, and so forth.

source: ཐམས་ཅད་ཀྱི་གནས་ཀྱི་གཞལ་མེད་ཁང་སྒོ་བྱེ་ཞིང་འདུག་པར་འགྱུར་རོ།
en: The doors of all their dwellings will remain open to him. “

source: །རྐེད་པ་ལ་བཏགས་ན་གཏེར་ཐམས་ཅད་འབྱུང་བར་འགྱུར།
en: If he ties the jewel to his hips, all buried treasure troves will rise to the surface.

source: པུས་མོ་གཡས་པ་དང་བརླ་གཡས་པ་ལ་བཏགས་ན་ནགས་ཀྱི་ཕུག་གི་གཞལ་མེད་ཁང་གི་གནས་ཐམས་ཅད་ཀྱི་སྒོ་ཕྱེ་ཞིང་།
en: If he places the jewel on his knee and ties it to his right thigh, all palatial residences accessible via forest passages will open their doors to him.

source: སྨན་གྱི་དངོས་པོ་ཐམས་ཅད་རང་གི་གཟུགས་ཀྱིས་མདུན་ན་གནས་པར་འགྱུར་ཞིང་ཐམས་ཅད་དབང་དུ་འགྱུར་རོ།
en: All medicinal substances and herbs will approach him in their respective forms and fall under his thrall. “

source: །རྐང་པའི་རྗེ་ངར་ལ་བཏགས་ན་རླུང་གི་ཕུང་པོ་དང་པོའི་སྟོབས་ཀྱི་ཤུགས་ཆེན་པོ་དང་ལྡན་པར་འགྱུར་ཞིང་།
en: If he ties the jewel to his lower calf, he will be able to move with the speed and great power of the wind.

source: ཅུང་ཟད་ཙམ་སོང་བས་དཔག་ཚད་སྟོང་ཕྲག་བཅུར་འགྲོ་ཞིང་སླར་ཡང་འོང་བར་འགྱུར།
en: With a small step he will be able to travel the distance of ten thousand leagues and come back again.

source: ཉིན་མཚན་གཅིག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་རླུང་ཆེན་པོའི་ཤུགས་ཀྱི་སྟོབས་དང་བརྩོན་འགྲུས་ཀྱིས་སོང་སྟེ། སླར་ཡང་འོང་བར་འགྱུར་ཞིང་གང་གིས་ཀྱང་གནོད་པར་མི་འགྱུར།
en: Using the great power, speed, and boldness of the wind, he will be able to travel around the entire thousandfold great trichiliocosm with all its world spheres in a single day and night and will never meet with any harm.

source: ཐམས་ཅད་དུ་དགོས་པ་བསྒྲུབ་པ་ཐམས་ཅད་འགྲུབ་པར་འགྱུར་རོ།
en: He will fully accomplish everything that needs to be accomplished, always achieving a complete success. “

source: །རྐང་མཐིལ་ལ་བཏགས་ན་སའི་འོག་གི་དངོས་གྲུབ་ཆེན་པོ་ཐོབ་པར་འགྱུར་ཞིང་།
en: If he ties the jewel to the sole of his foot, he will obtain the magical ability to enter the great subterranean paradise.

source: སའི་འོག་ཕུག་གི་སྒོ་ཐམས་ཅད་བྱེ་བར་འགྱུར་ཏེ།
en: The doors to the terrestrial passages to all subterranean paradises will remain open to him.

source: རང་ཇི་ལྟར་འདོད་པ་དེར་འཇུག་ཅིང་འབྱུང་བར་འགྱུར་རོ།
en: He will be able to enter and exit any place that he wants. “

source: །ཁར་བཅུག་ན་ཉི་མ་རེ་རེ་ཚིགས་སུ་བཅད་པ་སྟོང་ལོབས་པར་འགྱུར་རོ། །མིད་པ་ཙམ་གྱིས་ཐོས་པ་རྒྱ་མཚོ་བསགས་པར་འགྱུར་རོ།
en: If the vidyā holder keeps the jewel in his mouth every day as he recites one thousand verses, he will gain an ocean-like accumulation of knowledge merely by reading the verses aloud.

source: །ལྕེའི་རྩེ་མོར་བཞག་ན་ལྕེ་པདྨ་དང་ཀུ་མུ་ད་ལྟར་འཇམ་པར་འགྱུར་ཞིང་ཐོས་པ་མང་པོ་འཛིན་པར་འགྱུར་རོ།
en: If he keeps the jewel at the tip of his tongue, his tongue will become as smooth as a lotus or a water lily, and he will also be able to retain in memory anything he hears.

source: །ལག་པ་ལ་བྱུགས་ན་གང་ལ་རེག་པ་དེ་བྲན་བཞིན་དུ་འགྱུར་རོ། །སྐྱེས་པ་དང་།
en: If he rubs his hand with the jewel, anyone he touches will become his servant, eager to follow orders.

source: བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་དང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེ་ཐམས་ཅད་བགྱི་བ་ཅི་མཆིས་ཞེས་ཐམས་ཅད་དབང་དུ་འགྱུར་རོ།
en: All people—women, men, boys, girls, monks, or brahmins—will fall under his thrall and remain in his service. “

source: །ནོར་བུ་བསྒྲུབ་པའི་ཆོ་གའོ།། །།
en: This concludes the practice procedures of the jewel.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ལ་དོན་ཡོད་གྲུབ་ཀྱི་བུམ་པ་རབ་མཆོག་ཅེས་བགྱི་བའི་སྒྲུབ་པའི་ཆོ་ག་ཆེན་པོ་མཆིས་ཏེ།
en: The noble bodhisattva Avalokiteśvara, the great being, then said to the Blessed One, “I know, O lord, the great practice procedure called supreme pitcher of Amoghasiddhi.

source: དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ཡིད་བཞིན་གྱི་ནོར་བུའི་གཟུངས་ཀྱི་མཐུ་བསྟན་པ་ཇི་ལྟ་བ་དེར་དེ་ལྟར་བཅོམ་ལྡན་འདས་བུམ་པ་ཆེན་པོའི་མཐུ་སྒྲུབ་པའི་ཆོ་ག་འདི་རྣམ་པར་འཕྲུལ་བ་བསམ་གྱིས་མི་ཁྱབ་བསྒྲུབ་པ་འགྲུབ་པར་འགྱུར་ལགས་སོ།
en: This procedure of the great pitcher has the same power, O lord, as is observed in the heart dhāraṇī of Amoghapāśa that is like a great wish-fulfilling jewel. This procedure will bring success in the practices directed toward inconceivable magical transformations.

source: །རིག་སྔགས་འཆང་རྣམས་ལ་ཕན་པ་དང་བདེ་བའི་ཕྱིར་དེ་ཁོ་ན་ཉིད་ཡང་དག་པར་སྒྲུབ་པར་འགྱུར་བ་ལགས་སོ།
en: This procedure is taught for the benefit and happiness of all the vidyā holders and so that they may realize the truth. “

source: །དེ་ནས་གསེར་རམ་དངུལ་ལམ་ཟངས་སམ་ཁམ་པའི་བུམ་པ་ཚད་དང་ལྡན་པ་ཀུན་ནས་ཤིན་ཏུ་ཟླུམ་པ་མགོ་འམ་མགྲིན་པར་ཕྱིན་པའི་ཚད་འཇམ་ཞིང་ཐག་ཐུག་དང་ཤང་ཤོང་མེད་པ།
en: The vidyā holder should fashion a pitcher out of gold, silver, copper, or clay. It should have correct measurements, namely the right circumference, and a top and neck of the right size.

source: དབྱིབས་ལེགས་ཤིང་བྱི་དོར་ལེགས་པར་བྱས་པ། ཀུན་ནས་ཡོངས་སུ་གང་བ་ལ་མཚལ་གྱི་ཚོན་གྱིས་པདྨ་འདབ་མ་བརྒྱ་རྩ་བརྒྱད་པ་བྲི་བར་བྱ་སྟེ།
en: Its sides should be fine and smooth, and it should have a pleasant form, be clean, and have decorative motifs consisting of a total of one hundred and eight lotus petals painted all over it with vermillion.

source: མགྲིན་པར་པདྨའི་སྙིང་པོ་དང་ཟེ་བ་བྲི།
en: Motifs of lotus pericarps with stamens surrounded by petals should decorate its neck.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་བྲི་བར་བྱ་སྟེ། ཤར་ཕྱོགས་སུ་ཞལ་བྲི། ལྷོ་རུ་མི་འཇིགས་པ་སྦྱིན་པའི་ཕྱག །ནུབ་ཏུ་དབྱིག་འབྱིན་གྱི་ཕྱག །
en: The vidyā holder should also paint Noble Avalokiteśvara in his Amoghapāśa forms: on the eastern side of the pitcher he should depict the main form; on the southern side, the form that displays the gesture of protecting from the eight fears; on the northern side, the form that holds the wish-fulfilling jewel; and on the western side, the form that displays the gesture of granting comfort.

source: བྱང་དུ་ཡིད་བཞིན་ནོར་བུ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་སྐྱིལ་མོ་ཀྲུང་དུ་བཞུགས་པར་བྱའོ། །པདྨའི་འདབ་མ་དབང་ཕྱུག་དང་དབང་ཕྱུག་ཆེན་པོ་དང་། བྲམ་ཟེ་དང་དྲང་སྲོང་གི་ཚོགས་དང་། གཤིན་རྗེ་དང་། ཆུ་ལྷ་དང་།
en: All four should be adorned with all ornaments and sitting in a cross-legged posture among lotus petals. “

source: རླུང་ལྷ་དང་། ཁྱབ་བདག་དང་། བརྒྱ་བྱིན་དང་། རྡོ་རྗེ་འཆང་དང་། ལྷའི་ཚོགས་གཞན་དག་བྲི་བར་བྱ་ཞིང་མེ་དང་། རླུང་དང་། ཉི་མ་དང་། ཟླ་བ་དང་། ལྷ་མོ་སྒྲོལ་མ་
en: The gods Īśvara, Maheśvara, and Brahmā, the hosts of ṛṣis, and the gods Yama, Varuṇa, Kubera, Vāsava, Śakra, and Vajradhara should be depicted along with other gods, such as Agni, Vāyu, Sūrya, and Soma and the goddesses Tārā, Bhṛkuṭī, Śvetā, and Dūtī, as well as the gods Gaṇapati and Kumāra, the Four Great Kings, Rudra, and Viṣṇu.

source: དང་། ཁྲོ་གཉེར་ཅན་དང་། ཕོ་ཉ་མོ་དཀར་མོ་དང་། ཚོགས་ཀྱི་བདག་པོ་དང་། གཞོན་ནུ་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། དྲག་པོ་དང་། ཁྱབ་འཇུག་བྲི་བར་བྱའོ། །པདྨའི་འདབ་མའི་ཁོར་ཡུག་ཏུ་པདྨའི་ཕྲེང་བ་བྲིའོ།
en: They should be drawn on lotus petals all around the pitcher.

source: །དེ་ནས་བུམ་པ་ཚོན་སྣ་ཚོགས་ཀྱིས་བྲི་བར་བྱ་ཞིང་གསེར་གྱི་རྒྱན་གྱིས་བརྒྱན་པར་བྱ། རིམ་པའི་ཆ་བཀྲ་ཞིང་མཛེས་པར་བྱའོ།
en: The pitcher should be painted in various colors and adorned with golden ornaments of all kinds, and each part should be colorful and beautiful in all respects. “

source: །དེ་ནས་ཐང་ཤིང་ལས་པདྨའི་གདན་ཟླུམ་པོ་བུམ་པ་ཤོང་བ་ཙམ་གྱི་ཚད་དུ་བྱེད་ལ་དེའི་སྟེང་དུ་བུམ་པ་བཞག་ལ་བུམ་པ་དེ་ཡུངས་ཀར་དཀར་པོས་བཀང་སྟེ།
en: The vidyā holder should then fashion a lotus seat of the correct diameter from deodar wood and place the pitcher on it.

source: རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པར་བྱ།
en: He should fill the pitcher with white mustard seeds and adorn it with every ornament.

source: རས་དཀར་པོས་བཅིང་བར་བྱ། སྟེང་དུ་ཡུངས་ཀར་དང་གླ་རྩི་དང་ག་བུར་དང་གི་ཝང་དང་ལྡོང་རོས་གཞག་པར་བྱ།
en: He should tie it with fine white cotton cloth and place mustard seeds, musk, camphor, bovine bezoar, and realgar on top of it.

source: བུམ་པའི་ཁ་རས་དམར་པོས་གཡོགས་པར་བྱ། རིན་པོ་ཆེ་སྣ་བདུན་གཞག་པར་བྱ།
en: He should then cover the opening of the pitcher with a red cloth and place small fragments of the seven types of jewels on it. “

source: དེ་ནས་རིག་སྔགས་འཆང་གཙང་མས་གོས་གཙང་མ་བགོས་ལ་དཀྱིལ་འཁོར་ཁྲུ་བཞི་གྲུ་བཞི་པ་འཕང་དུ་ཁྲུ་གང་བ་བྱས་ཏེ།
en: The vidyā holder, ritually pure and wearing clean clothes, should build a maṇḍala four cubits in diameter with its surface raised half a cubit. It should be skillfully made of clay and cow dung with an impeccable finish.

source: བ་ལང་གི་ལྕི་བ་དང་སར་བསྲེས་པས་ལེགས་པར་བྱུགས་ཏེ་ཆ་མཉམ་པར་བྱའོ།
en: It should have a symmetrical shape with four equal sides and should be clean.

source: །དེ་ནས་དཀྱིལ་འཁོར་གྱི་སྟེང་དུ་དྲི་ཐམས་ཅད་ཀྱིས་བྱུགས་ལ་དཀྱིལ་འཁོར་གྱི་སྙིང་པོ་དབུས་སུ་ཙནྡན་དཀར་པོས་དཀྱིལ་འཁོར་ཁྲུ་གང་གྲུ་བཞི་པ་བྱས་ལ།
en: The vidyā holder should smear its surface with every fragrance. In the center of the maṇḍala, he should use white sandalwood to demarcate a smaller maṇḍala with four corners that is one cubit in diameter.

source: གུར་གུམ་དང་མེ་ཏོག་པདྨས་མཆོད་པ་བྱས་ཏེ།
en: He should offer lotus flowers, together with saffron, and draw a thirty-two-petaled lotus with filaments in the middle.

source: པདྨ་འདབ་མ་སུམ་ཅུ་རྩ་གཉིས་པ་བྲི་ལ་པདྨའི་ཟེ་བའི་སྟེང་དུ་བུམ་པ་གཞག་སྟེ།
en: He should place the pitcher on this lotus. “

source: འཕན་གདུགས་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པར་བྱ། དཀྱིལ་འཁོར་གྱི་སྙིང་པོ་ཁོར་ཡུག་ཏུ་སྤོས་དང་མེ་ཏོག་སྣ་ཚོགས་དང་བྱུག་སྤོས་སྣ་ཚོགས་དང་།
en: He should adorn it with various statues and banners and place vessels around the inner circle that are filled with various perfumes and unguents.

source: མཆོད་ཡོན་གྱི་སྣོད་སྣ་ཚོགས་དང་བུམ་པ་གང་བར་མཛེས་པ་དང་བདུག་སྤོས་ཀྱི་ཕྱེ་མ་རྣམ་པ་མང་པོ་གཞག་པར་བྱ། མེ་ཏོག་རྣམ་པ་སྣ་ཚོགས་དང་མེ་ཏོག་ཕྲེང་ཅི་འབྱོར་པ་ཀུན་ཏུ་གཞག་པར་བྱ། མར་གྱི་མར་མེ་བཟང་པོ་བཅུ་དྲུག་བལྟམ་པར་བྱ། ཕྱི་རོལ་གྱི་དཀྱིལ་འཁོར་ཀུན་ནས་པདྨའི་ཕྲེང་བ་བྲི་བར་བྱ། སྒོ་བཞི་ཤིན་ཏུ་མཛེས་པ་བྲི་བར་བྱ།
en: He should arrange bowls with argha water and jars full of offerings, add incense holders filled with incense of many kinds, flowers of various types, and garlands.. Outside the maṇḍala, he should skillfully draw four symmetrically arranged doors with lokeśvara marks and a garland of lotuses.

source: འཇིག་རྟེན་དབང་ཕྱུག་གི་མཚན་མ་གསལ་བར་བྱ། མདའ་དང་བ་དན་ཁོར་ཡུག་ཏུ་གཞག་པར་བྱ། ཚོན་སྐུད་སྣ་ལྔས་བསྐོར་བར་བྱ།
en: Around this he should place arrows and banners, and he should wrap the entire maṇḍala with five-colored thread. “

source: རོ་རྣམ་པ་སྣ་ཚོགས་དང་དཀར་གསུམ་ཅི་འབྱོར་པ་གཞག་པར་བྱ། འབྲས་བུ་སྣ་ཚོགས་དང་བཟའ་བ་རྣམ་པ་སྣ་ཚོགས་གཞག་པར་བྱ།
en: He should arrange various types of the three ‘white’ foods with various tastes as are available, as well as a variety of fruits and other edibles.

source: མེ་ཏོག་སྣ་ཚོགས་གཞག་པར་བྱ། མེ་ཏོག་སྣ་ཚོགས་དགྲམ་པར་བྱ། མེ་ཏོག་ཕྲེང་བཟང་པོ་ཀུན་ཏུ་གཞག་པར་བྱ། བདུག་སྤོས་ཀྱི་སྣོད་དང་བུམ་པ་གང་བ་ཀུན་ཏུ་གཞག་པར་བྱ།
en: He should scatter various flowers and arrange garlands, incense holders, and similar items around the maṇḍala.

source: པོག་ཕོར་བཞི་གཞག་པར་བྱ། དྲི་ཆབ་ཀྱི་ཕོར་པ་བཞི་གཞག་པར་བྱ། སྣོད་བཞི་དང་ཁམ་ཕོར་བརྒྱད་གཞག་པར་བྱ། རོ་སྣ་ཚོགས་ཀྱི་གཏོར་མ་དཀར་པོ་རྣམ་པ་མང་པོ་གཞག་པར་བྱ།
en: He should also distribute around the maṇḍala four full jars with four spoons and add four perfume flasks, four water containers, and eight earthenware dishes filled with bali offerings made of ‘white’ foodstuffs of many kinds and various tastes.

source: མར་གྱི་མར་མེ་གང་བ་དྲུག་ཅུ་རྩ་གཉིས་དབུལ་བར་བྱ།
en: He should light sixty-one butter-filled lamps and strew the maṇḍala with parched rice and mustard seeds. “

source: འབྲས་ཡོས་དང་ཡུངས་ཀར་དགྲམ་པར་བྱའོ། །ཆང་དང་ཤ་དང་བེག་བཙོང་དང་ཀེའུ་དང་འབགས་པ་དང་ཁ་ཟས་ངན་པ་དང་བཏུང་བ་ངན་པ་སྤང་བར་བྱ། བགོ་མ་ཉེས་སྤང་བར་བྱ་སྟེ།
en: He should avoid alcohol, meat, onions, food containing garlic, food and drink that have gone bad, and food that is difficult to digest.

source: གཙང་མས་གོས་གཙང་མ་བགོས་ལ་ཟླ་བ་ཉ་བ་ལ་བསྒྲུབ་པར་བྱའོ།
en: He should be ritually pure and wear clean clothes. To succeed, he should perform the rite on the day of the full moon.

source: །སྲུང་བའི་ཆོ་གས་བདག་བསྲུང་བ་དང་ཐོར་ཚུགས་བཅིང་བ་དང་། ཕྱོགས་བཅིང་བ་དང་། ཡུལ་བཅིང་བ་དང་། དེ་བཞིན་དུ་གྲོགས་བསྲུང་བ་དང་གཞན་བསྲུང་བ་ཡང་བྱའོ།
en: He should begin with the protection rite, including self-protection, tie his hair in a topknot, bind the directions and the maṇḍala elements, and perform the protection for his assistants and everyone else.

source: །གུ་གུལ་གྱི་བདུག་པ་དང་མར་དང་ཡུངས་ཀར་གྱི་བདུག་པས་བདུག་པར་བྱའོ། །ཙནྡན་དང་། ཨ་ག་རུ་དང་། ཏུ་རུ་སྐ་དང་།
en: He should burn bdellium, mustard seeds, and ghee.

source: ཀུན་དུ་རུའི་བདུག་པ་འདི་ནི་ཡང་དག་པར་བསྟན་ཏོ།
en: Incense consisting of sandalwood, agarwood, frankincense, and olibanum has also been taught.

source: །བུམ་པ་སྒྲུབ་པ་འདི་ནི་མཆོག་སྟེ་ཞག་ལྔ་སྨྱུང་བ་བྱས་ནས་གསང་སྔགས་བསྒྲུབ་པར་བྱ་སྟེ།
en: This practice of the pitcher is supreme. “For the greatest efficacy of the mantra, the vidyā holder should fast for five days and nights.

source: དུས་མཚམས་གསུམ་དུ་བུམ་པ་དང་སངས་རྒྱས་ལ་མཆོད་པར་བྱའོ།
en: He should make offerings to the pitcher and the Buddha at the three junctions of the day without speaking.

source: །མི་སྨྲ་བར་དཀྱིལ་འཁོར་ལ་མངོན་དུ་ཕྱོགས་ཏེ་སྐྱིལ་མོ་ཀྲུང་དུ་འདུག་ནས་ལག་པ་གཡས་པ་བུམ་པའི་སྟེང་དུ་བཞག་ནས་ཁྲོ་བོའི་རྒྱལ་པོ་སྟོང་རྩ་བརྒྱད་བཟླས་ལ་ཆུ་དང་ཡུངས་ཀར་གྱིས་དབང་བསྐུར་ལ་དོན་ཡོད་པའི་ཞགས་པའི་གཟུངས་སྟོང་ཕྲག་བརྒྱད་ཅུ་བཟླས་སོ།
en: Sitting cross-legged in front of the maṇḍala, he should place his right hand on top of the pitcher and recite the Krodharāja mantra one thousand and eight times while sprinkling the pitcher with water and mustard seeds.

source: །ཡིད་ལ་བྱེད་པ་རྩེ་གཅིག་པས་སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པ་དང་སྙིང་རྗེ་ལྷུར་ལེན་ཅིང་སངས་རྒྱས་ཡིད་ལ་བྱ་བ་སྒོམ་ལ་བཟླས་བརྗོད་བྱའོ།
en: He should recite the heart mantra of Amoghapāśa ten thousand times while generating, with full focus, loving kindness for all beings and giving himself completely over to the feeling of compassion. He should recite the mantra while calling to mind and contemplating the Buddha. “

source: །དེའི་འོག་ཏུ་ཚེས་བཅྭ་ལྔ་ཉའི་ཐུན་ཐ་མའི་ནང་པར་དབྱིག་གི་བུམ་པ་ཆེར་གཡོ་བར་འགྱུར་ཞིང་ལེགས་སོ་ཞེས་བྱ་བའི་སྒྲ་ཆེན་པོ་ཡང་གྲག་པར་འགྱུར་ཏེ།
en: Then, during the last watch of the fifteenth night, the night of the full moon, at the junction of night and day just before dawn, the golden pitcher will shake violently. The word ‘bravo!’

source: བུམ་པ་ཆེན་པོ་དེ་ཡང་འབར་ཞིང་འོད་ཟེར་ཁ་དོག་སྣ་ལྔ་འབྱུང་བར་འགྱུར།
en: will be heard loudly, and the great pitcher will blaze, radiating light of various colors.

source: རིག་སྔགས་འཆང་དགའ་བར་འགྱུར། དྲི་མ་མེད་ཅིང་ཡོངས་སུ་དག་ལ་དྲི་མ་དང་བྲལ་བར་འགྱུར། མདོག་ཡོངས་སུ་དག་ཅིང་མེ་ཏོག་པདྨ་དང་ཀུ་མུ་ད་ལྟར་དཀར་ཞིང་འཇམ་པར་འགྱུར།
en: The vidyā holder will be thrilled with joy and become immaculately pure without any stains, his complexion will become very clear and white, and his skin will be as smooth as a lotus or water lily.

source: བུམ་པ་དེའི་སྐུ་གཟུགས་རྣམས་རང་རང་གི་ལུས་ལས་འོད་ཟེར་འབྱུང་བར་འགྱུར་རོ།
en: The pitcher will replicate, and each one will radiate light.

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་མཆོད་པ་རྒྱ་ཆེན་པོ་བྱ། རིག་སྔགས་འཆང་བུམ་པ་བསྒྲུབ་པ་འདི་ནི་གྲུབ་བོ།
en: Now that the vidyā holder has accomplished the practice of the pitcher, he should perform an elaborate pūjā, making bounteous offerings to Noble Avalokiteśvara. “

source: །དེའི་འོག་ཏུ་རིག་སྔགས་འཆང་གིས་དྲིའི་ཆུ་དང་ཡུངས་ཀར་ལ་ཁྲོ་བོའི་རྒྱལ་པོ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་ནས་དབང་བསྐུར་བར་བྱས་ན་དབང་བསྐུར་མ་ཐག་ཏུ་བུམ་པ་དེ་ལས་སྒྲ་འབྱུང་བར་འགྱུར་ཏེ།
en: He should then sprinkle the pitcher with mustard seeds and water incanted twenty-one times with the Krodharāja mantra, causing the pitcher to immediately emit the following words: ‘Good!

source: རིག་སྔགས་འཆང་ཆེན་པོ་ལེགས་སོ་ལེགས་སོ།
en: Good, O great vidyā holder!

source: །ཁྱོད་ཀྱིས་བུམ་པ་བཟང་པོ་གྲུབ་སྟེ་བུམ་པ་བཟང་པོ་ཇི་ལྟ་བ་བཞིན་དོན་ཡོད་པའི་སྙིང་པོའི་བུམ་པ་བཟང་པོ་ཡིད་བཞིན་གྱི་ནོར་བུ་ཆེན་པོ་ཡང་དེ་བཞིན་གྱིས་ཇི་ལྟར་འདོད་པར་ལོངས་སྤྱོད་ཅིག །
en: You have accomplished the practice of the auspicious pitcher. Just like the auspicious pot, this auspicious pitcher, the essence of Amoghapāśa, is a great wish-fulfilling jewel. You can, in consequence, enjoy its benefits to your heart’s content.

source: ཡིད་ལ་ཇི་ལྟར་བསམས་ཤིང་བཅོལ་བ་ཐམས་ཅད་གྲུབ་པར་གྱུར་ཅིག །
en: You can accomplish anything you can think of and make any request.’ “

source: དེ་ནས་མཆོད་པ་ཆེན་པོས་གཞལ་མེད་ཁང་ཆེན་པོ་མཆོད་དེ་བུམ་པ་བཟང་པོ་དེ་གཟུང་བར་བྱ་ཞིང་མཆོད་པ་བྱས་ན་ཡིད་ལ་ཇི་ལྟར་འཐད་པ་དང་འདོད་པ་ཐམས་ཅད་གྲུབ་པར་འགྱུར་ཏེ།
en: This auspicious pitcher should be worshiped as if it were a great palace; its rites should be upheld and its worship encouraged. It will produce whatever accomplishment is desired.

source: ལེགས་པར་བཤད་པའམ་གཙུག་ལག་གམ། སྙན་དང་གས་དང་གར་གྱི་བསྟན་བཅོས་དང་རྩིས་ཆོས་དང་བྱཱ་ཀ་ར་ཎ་དང་ཆོ་ག་ཞིབ་མོ་སྨྲ་བ་དང་གསང་སྔགས་སྨྲ་བ་དང་།
en: It will bring mastery of poetry and drama, whether it is belles-lettres or the writings of ancient sages, and proficiency in math, arithmetic, grammar, and the doctrines of ritual and mantra.

source: ནགས་སྒྲུབ་བ་དང་ཕུག་སྒྲུབ་པ་དང་བཅུད་ཀྱིས་ལེན་པ་དང་མིག་སྨན་དང་། གཏེར་སྨྲ་བ་དང་།
en: It will also enhance the ability to discover terrestrial passages and create an elixir of longevity and magical ointment for the eyes.

source: རིག་བྱེད་ཀྱི་སྔགས་དང་མདོ་སྡེ་དང་། དབྱངས་ཀྱིས་བསྙད་པའི་སྡེ་ལ་སོགས་པ་ཆོས་དང་འདུལ་བ་སྨྲ་བ་དེ་དག་ཐམས་ཅད་འབྱུང་བར་འགྱུར་རོ། །འདི་ལྟ་སྟེ་ཟས་དང་། སྐོམ་དང་། གོས་དང་། རྒྱན་དང་། སྤུད་པ་དང་། གསེར་དང་། དངུལ་དང་། ས་ལེ་སྦྲ་
en: In addition, the vidyā holder will obtain the knowledge of alchemy, mantras, sūtras, songs, Dharma, and the formal rules of discipline. “

source: མ་དང་། མུ་ཏིག་དང་། ཨིནྡྲ་ནཱི་ལ་དང་། མ་རྒད་དང་། ཀེ་ཀེ་རུ་དང་། ཤེལ་དང་། མུས་ར་དང་། བཻ་ཌཱུརྱ་དང་། མཐོན་ཀ་དང་། མཐོན་ཀ་ཆེན་པོ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་དང་། གོས་དང་། མ་ལ་ཆ་དང་། གནས་དང་། ཁང་པ་དང་། ལོངས་སྤྱོད་དང་། རྩེད་མོ་རྒྱ་ཆེན་པོ་དང་རྒྱལ་པོ་ལ་འོས་པའི་ལྷའི་གཞལ་མེད་ཁང་ཆེན་པོ་རྣམས་སེམས་ཀྱིས་བསམས་པ་ཙམ་གྱི་མོད་ལ་འབྱུང་བར་འགྱུར་རོ།
en: All things—food, drink, clothes, adornments, ornaments, minted coins, silver, gold bullion and wrought gold, pearls, conches, khaṇḍika, sapphires, emeralds, karketana stones, quartz crystals, coral, beryl, lapis lazuli, sapphires, fruits, flowers, conveyances, clothes, beds, seats, cushions, palaces, pleasures, amusements, and large palaces fit for a king—will physically manifest as soon as he thinks of them.

source: །མིག་འཕྲུལ་གྱི་གཞལ་མེད་ཁང་དང་སངས་རྒྱས་ཀྱི་སྤྲུལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྲུལ་པ་དང་། རྡོ་རྗེ་འཆང་གི་སྤྲུལ་པ་དང་ལྷ་དང་། ཀླུ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། དྲི་ཟ་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་གཞལ་མེད་ཁང་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། འབྱུང་པོའི་བདག་པོའི་གཞལ་མེད་ཁང་དེ་ཐམས་ཅད་བསམས་པ་ཙམ་གྱིས་འབྱུང་བར་འགྱུར་རོ།
en: Magically emanated palaces in all possible forms—those created by buddhas, by bodhisattvas, or by Vajradhara, the palaces of nāgas, asuras, garuḍas, kinnaras, gandharvas, and mahoragas, and the palaces of the lords of yakṣas, rākṣasas, and bhūtas—will all manifest as he thinks of them. “

source: །ཆར་ཧ་ཅང་ཆེ་བ་དང་ཆར་མི་འབབ་པ་དང་། དུས་མ་ཡིན་པའི་ཆར་དང་། གྲང་བ་དང་། རླུང་དང་། སྤྲིན་དང་།
en: The auspicious pitcher can manifest excessive rains, droughts, unseasonal rains, cold spells, hurricanes, hailstorms, or floods.

source: སེར་བ་དང་ཆུ་ཟློག་པར་བྱེད་པ་དེ་ཐམས་ཅད་སྟོན་པར་བྱེད་པ་སྡེ་སྟོན་པར་བྱེད་པ་གཡུལ་འགྱེད་པ་སྟོན་པར་བྱེད་པའམ། གནས་དང་གཞལ་མེད་ཁང་དང་།
en: It can manifest anything, including soldiers, armed conflicts, specific places, residences, and royal splendor.

source: དཔལ་སྟོན་པར་བྱེད་པ་དེ་ཐམས་ཅད་སྟོན་པར་བྱེད། དེ་ལ་སོགས་པ་ཐམས་ཅད་བསམས་པ་ཙམ་དང་། སྨོན་པ་ཙམ་གྱིས་འགྲུབ་པར་འགྱུར་རོ།
en: The pitcher can manifest all this and other things: whatever the vidyā holder thinks of or requests can be manifested.

source: །ནོར་བུ་དང་། འབྲུ་དང་། འབྲས་བུ་དང་། མེ་ཏོག་དང་། གཞལ་མེད་ཁང་འབྱུང་བར་འགྱུར་རོ།
en: Money, grain, fruits, flowers, and palaces will manifest for him.

source: །ཇི་ལྟར་བསམས་པ་དེ་ཐམས་ཅད་འབྱོར་བར་འགྱུར་རོ།
en: He will be successful in anything he can think of. “

source: །གླ་རྩི་དེ་བླངས་ལ་གི་ཝང་དང་ག་པུར་དང་བསྲེས་ཏེ་ཤིང་ཨརྐའི་འོ་མས་སྦྲུས་ཏེ།
en: The vidyā holder should take musk, mix it with bovine bezoar and camphor, add the sap of giant milkweed, make it into a pill, and then knead the pill with the milk of a tawny cow.

source: རིལ་བུ་བྱས་ནས་བ་སེར་མོའི་འོ་མ་ལ་བདར་ཏེ་དཔྲལ་བར་ཐིག་ལེ་བྱས་ན་ནམ་མཁའ་ལ་འགྲོ་བར་འགྱུར། རིག་སྔགས་འཆང་བྱེ་བ་སྟོང་ཕྲག་བཅུའི་འཁོར་དང་ལྡན་པར་འགྱུར།
en: If he then applies it to his forehead as a bindi, he will be able to travel through space with tens of thousands of millions of vidyādharas in his retinue.

source: སྙིང་གར་ཐིག་ལེ་བྱས་ན་མི་སྣང་བར་འགྱུར་ཞིང་གནོད་སྦྱིན་དང་།
en: If he applies the bindi to his chest, he will become invisible.

source: སྲིན་པོ་དང་། འབྱུང་པོ་ཐམས་ཅད་ཀྱི་རྗེ་དཔོན་དུ་འགྱུར་རོ།
en: All yakṣas, rākṣasas, and bhūtas, on the other hand, will be visible to him.

source: །ལྕེའི་རྩེ་མོ་ལ་རེག་ན་ཉིན་རེ་ཞིང་ཚིགས་སུ་བཅད་པ་སྟོང་བཀླགས་ཤིང་འཛིན་པར་འགྱུར།
en: If he touches the pill to the tip of his tongue, he will be able to read three thousandverses every single day and retain them in memory.

source: མིད་ན་ལོ་སྟོང་ཕྲག་བཅུར་འཚོ་བར་འགྱུར།
en: If he swallows it, his lifespan will increase to ten thousand years.

source: འོ་མ་དང་ལྷན་ཅིག་འཐུངས་ན་ཐོས་པ་མང་པོ་རྒྱ་མཚོ་བསགས་པར་འགྱུར།
en: If he eats the pill with porridge with milk, he will become an ocean-like vessel of great learning.

source: ཤིང་ཨརྐའི་ལོ་མ་དང་ལྷན་ཅིག་ཟོས་ན་རིག་སྔགས་འཆང་ཐམས་ཅད་ཀྱི་འཁོར་ལོས་སྒྱུར་བར་འགྱུར། ཆོ་ག་ཞིབ་མོ་དང་། གསང་སྔགས་དང་དཀྱིལ་འཁོར་དང་། ཕྱག་རྒྱ་ཐམས་ཅད་མངོན་དུ་འགྱུར།
en: If he eats it with the sap of giant milkweed, he will become an emperor of all vidyādharas, and all rites, mantras, maṇḍalas, and mudrās will be revealed to him. “

source: ལྟེ་བའི་གནས་སུ་ཐིག་ལེ་བྱས་ཏེ་ཆུ་ཀླུང་ཆེན་པོའི་ནང་དུ་ཞུགས་ན་གཏིང་དུ་འབྱིང་བར་མི་འགྱུར་ཞིང་ཕ་རོལ་ཏུ་ཕྱིན་པར་འགྱུར།
en: If he applies the pill as bindi to his navel, he will be able to descend into a broad river and reach the other shore by walking on the bottom.

source: རྒྱ་མཚོའི་ཕ་རོལ་ཏུ་ཡང་ཕྱིན་པར་འགྱུར།
en: He will even be able to reach the other shore of an ocean.

source: སྤྱི་བོར་ཐིག་ལེ་བྱས་ཏེ་གཡུལ་ངོར་ཞུགས་ན་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་ལས་རྒྱལ་བར་འགྱུར།
en: If he applies the bindi to his head, he will be able to enter the thick of the battle and defeat an entire army with its four divisions.

source: ཞུན་མར་དང་ལྷན་ཅིག་ཟོས་ན་གླང་པོ་ཆེན་པོ་སྟོང་གི་སྟོབས་དང་ལྡན་པར་འགྱུར་ཞིང་།
en: If he eats the pill with ghee, he will obtain the strength of one thousand large elephants.

source: ལག་པ་ཡ་གཅིག་གིས་གླང་པོ་ཆེ་བསྐྱོད་པ་དང་ནམ་མཁའ་ལ་འཕེན་ཅིང་སླར་ཡང་འཛིན་ཏོ།
en: He will be able to fling an elephant with one hand, tossing it into the sky and catching it again.
